src/Tasks/ЗадачаИсполнителя/ЗадачаИсполнителя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачаИсполнителя</name>
  <addressing>InformationRegister.ИсполнителиЗадач</addressing>
  <attributes>
    <name>Автор</name>
    <comment>Автор бизнес-процесса, который сформировал задачу</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <comment>Важность задачи - для приоритезации исполнителем своих задач</comment>
    <type>
      <types>EnumRef.ВариантыВажностиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполнения</name>
    <comment>Дата и время фактического выполнения задачи</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <comment>Дата начала выполнения задачи - для приоритезации исполнителем своих задач</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятияКИсполнению</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание постановки задачи для исполнителя</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключенаИзПроцесса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПредмет</name>
    <comment>Предмет задачи</comment>
    <type>
      <types>CatalogRef.ТемыОбсуждений</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.СообщенияОбсуждений</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметСтрокой</name>
    <comment>Строковое представление предмета</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПринятаКИсполнению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроектнаяЗадача</name>
    <type>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполнения</name>
    <comment>Описание результата выполнения</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеБизнесПроцесса</name>
    <type>
      <types>EnumRef.СостоянияБизнесПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>Плановый срок исполнения задачи</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущийДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущийИсполнитель</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущийОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийИсполнитель</name>
    <type>
      <types>CatalogRef.ПолныеРоли</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Предметы</name>
    <attributes>
      <name>РольПредмета</name>
      <type>
        <types>EnumRef.РолиПредметов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредмета</name>
      <type>
        <types>CatalogRef.ИменаПредметов</types>
      </type>
    </attributes>
    <attributes>
      <name>Предмет</name>
      <comment>Предмет задачи</comment>
      <type>
        <types>CatalogRef.УведомленияПрограммы</types>
        <types>CatalogRef.ТемыОбсуждений</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Проекты</types>
        <types>CatalogRef.ПротоколыМероприятий</types>
        <types>DocumentRef.ВходящееПисьмо</types>
        <types>DocumentRef.ИсходящееПисьмо</types>
        <types>CatalogRef.Файлы</types>
        <types>CatalogRef.ВходящиеДокументы</types>
        <types>DocumentRef.Бронь</types>
        <types>CatalogRef.ВнутренниеДокументы</types>
        <types>CatalogRef.СообщенияОбсуждений</types>
        <types>CatalogRef.ИсходящиеДокументы</types>
        <types>CatalogRef.Мероприятия</types>
        <types>CatalogRef.ПроектныеЗадачи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступноУдаление</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбязательноеЗаполнение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <addressingAttributes>
    <name>УдалитьДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>УдалитьОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>УдалитьРольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.ПолныеРоли</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЯзыка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВДокументах</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенныеВебСерверы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВПереписке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВПерепискеСРангом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>105</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.ТерриторииИПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Tasks/ЗадачаИсполнителя/Forms/ПеренаправлениеЗадачи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Исполнитель = Неопределено Тогда
		Исполнитель = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	Задача = Параметры.Задача;
	
	Если Параметры.Свойство("МассивЗадач") Тогда
		МассивЗадач.ЗагрузитьЗначения(Параметры.МассивЗадач);
		ЭтаФорма.Заголовок = СтрШаблон(НСтр("ru = 'Перенаправление задач (%1 шт)'"), 
			Параметры.МассивЗадач.Количество());
	Иначе
		МассивЗадач.Добавить(Задача);			
	КонецЕсли;	
	
	// Сохранение вводимых значений
	СохранениеВводимыхЗначений.ЗаполнитьСписокВыбора(ЭтаФорма, ЭлементыДляСохранения(), ЭтаФорма.ИмяФормы);
	
	ПроверятьОтсутствие = Отсутствия.ПредупреждатьОбОтсутствии();
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		НастроитьЭлементыФормыДляМобильногоУстройства();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("Исполнитель");
	
	Если ТипЗнч(Исполнитель) = Тип("СправочникСсылка.ПолныеРоли")
		И Не ИгнорироватьПредупреждения 
		И Не БизнесПроцессыИЗадачиСервер.ЕстьИсполнителиРоли(Исполнитель) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'На указанную роль не назначено ни одного исполнителя. (Чтобы проигнорировать это предупреждение, установите флажок.)'"),,,
			"Исполнитель",
			Отказ);
		Элементы.ИгнорироватьПредупреждения.Видимость = Истина;
	КонецЕсли;
	
	// Проверка прав доступа участников процесса на предмет
	Если ДокументооборотПраваДоступаПовтИсп.ВключеноИспользованиеПравДоступа() Тогда
		
		Для Каждого СтрСписок Из МассивЗадач Цикл
			
			ТекЗадача = СтрСписок.Значение;
			
			РеквизитыЗадачи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекЗадача, "БизнесПроцесс, СрокИсполнения");
			БизнесПроцесс = РеквизитыЗадачи.БизнесПроцесс;
			СрокИсполнения = РеквизитыЗадачи.СрокИсполнения;
			
			ПредметыМассив = МультипредметностьКлиентСервер.ПолучитьМассивПредметовОбъекта(БизнесПроцесс);
			
			Если ПредметыМассив.Количество() > 0 Тогда
				
				// Определим предметы для проверок
				ПредметыДляПроверкиПрав = 
					Мультипредметность.ПредметыДляПроверкиПрав(ПредметыМассив, БизнесПроцесс);
					
				ПредметыДляПроверкиПравДоступаУчастников = 
					ПредметыДляПроверкиПрав.ДляПроверкиПравДоступаУчастников;
				
				ПредметыДляПроверкиНарушенияПолитикиДоступа = 
					ПредметыДляПроверкиПрав.ДляПроверкиНарушенияПолитикиДоступа;
				
				ПредметыСОграниченнымДоступом = Новый Массив;
				
				// Проверка нарушения политики доступа при расширении рабочей группы предмета.
				Участники = РаботаСРабочимиГруппами.ПолучитьПустуюТаблицуУчастников();
				РаботаСРабочимиГруппами.ДобавитьУчастникаВТаблицуНабора(Участники, Исполнитель);
				
				Для Каждого Предмет Из ПредметыДляПроверкиНарушенияПолитикиДоступа Цикл
					Попытка
						Мультипредметность.ПроверитьНарушениеПолитикиДоступаПриРасширенииРабочейГруппыПредмета(
							Предмет, Участники);
					Исключение
						ПредметыСОграниченнымДоступом.Добавить(Предмет);
					КонецПопытки;
				КонецЦикла;
				
				// Проверка прав на предметы без автоматического заполнения рабочей группы.
				
				ПользователиДляПроверки = 
					Мультипредметность.ПользователиДляПроверкиПрав(Участники);
				
				ПраваУчастниковНаПредметы = ДокументооборотПраваДоступа.ПолучитьПраваПользователейПоОбъектам(
					ПредметыДляПроверкиПравДоступаУчастников,
					Истина,
					ПользователиДляПроверки.ВыгрузитьКолонку("Участник"));
				
				Для Каждого Предмет Из ПредметыДляПроверкиПравДоступаУчастников Цикл
					
					Для Каждого СтрокаПользователь Из ПользователиДляПроверки Цикл
						
						Отбор = Новый Структура;
						Отбор.Вставить("ОбъектДоступа", Предмет);
						Отбор.Вставить("Пользователь", СтрокаПользователь.Участник);
						
						НайденныеПрава = ПраваУчастниковНаПредметы.НайтиСтроки(Отбор);
						Если НайденныеПрава.Количество() = 0 Тогда
							ПредметыСОграниченнымДоступом.Добавить(Предмет);
						КонецЕсли;
					КонецЦикла;
					
				КонецЦикла;
				
				КоличествоПредметов = ПредметыСОграниченнымДоступом.Количество();
				
				Если КоличествоПредметов <> 0 Тогда
					
					Отказ = Истина;
					
					ТекстОшибки = "%1%2";
					
					Если ТипЗнч(Исполнитель) = Тип("СправочникСсылка.ПолныеРоли") Тогда
						ПерваяЧастьТекстаОшибки = НСтр("ru = 'У некоторых исполнителей роли нет прав '");
					Иначе
						ПерваяЧастьТекстаОшибки = НСтр("ru = 'У пользователя нет прав '");
					КонецЕсли;
					
					Если КоличествоПредметов = 1 Тогда
						ВтораяЧастьТекстаОшибки = СтрШаблон(
							НСтр("ru = 'на предмет ""%1""'"),
							Строка(ПредметыСОграниченнымДоступом[0]));
					Иначе
						
						ПредметыСтрокой = "";
						
						ПереносСтроки = "";
						
						Для Каждого Предмет Из ПредметыСОграниченнымДоступом Цикл
							ПредметыСтрокой = ПредметыСтрокой
								+ ПереносСтроки
								+ "  "
								+ Строка(Предмет);
							
							ПереносСтроки = Символы.ПС;
						КонецЦикла;
						
						ВтораяЧастьТекстаОшибки = НСтр("ru = 'на предметы
							|%1'");
						
						ВтораяЧастьТекстаОшибки = СтрШаблон(
							ВтораяЧастьТекстаОшибки,
							ПредметыСтрокой);
						
					КонецЕсли;
					
					ТекстОшибки = СтрШаблон(ТекстОшибки, ПерваяЧастьТекстаОшибки, ВтораяЧастьТекстаОшибки);
					Если Не ЗначениеЗаполнено(Задача) Тогда
						ТекстОшибки = ТекстОшибки + ". " + Строка(ТекЗадача);
					КонецЕсли;	
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						ТекстОшибки,,
						"Исполнитель");
					
				КонецЕсли;
				
				// Проверка прав на файлы предметов без автоматического заполнения рабочей группы.
				УчастникиБезПравНаФайлы = УправлениеМероприятиями.ПроверитьПраваУчастниковПроцессаНаФайлыПредметов(
					БизнесПроцесс,
					ПредметыДляПроверкиПравДоступаУчастников,
					ПользователиДляПроверки);
				Если УчастникиБезПравНаФайлы <> Неопределено Тогда
					
					ПредметыСОграниченнымДоступомКФайлам = Новый Массив;
					
					Для Каждого Предмет Из ПредметыДляПроверкиПравДоступаУчастников Цикл
						
						Отбор = Новый Структура;
						Отбор.Вставить("Предмет", Предмет);
						НайденныеУчастникиБезПрав = УчастникиБезПравНаФайлы.НайтиСтроки(Отбор);
						Если НайденныеУчастникиБезПрав.Количество() <> 0 Тогда
							ПредметыСОграниченнымДоступомКФайлам.Добавить(Предмет);
						КонецЕсли;
						
						КоличествоПредметов = ПредметыСОграниченнымДоступомКФайлам.Количество();
						Если КоличествоПредметов <> 0 Тогда
							
							Отказ = Истина;
							
							ТекстОшибки = "%1%2";
							
							Если ТипЗнч(Исполнитель) = Тип("СправочникСсылка.ПолныеРоли") Тогда
								ПерваяЧастьТекстаОшибки = НСтр("ru = 'У некоторых исполнителей роли нет прав '");
							Иначе
								ПерваяЧастьТекстаОшибки = НСтр("ru = 'У пользователя нет прав '");
							КонецЕсли;
							
							Если КоличествоПредметов = 1 Тогда
								ВтораяЧастьТекстаОшибки = СтрШаблон(
									НСтр("ru = 'на файлы предмета ""%1""'"),
									Строка(ПредметыСОграниченнымДоступомКФайлам[0]));
							Иначе
								
								ПредметыСтрокой = "";
								
								ПереносСтроки = "";
								
								Для Каждого Предмет Из ПредметыСОграниченнымДоступомКФайлам Цикл
									ПредметыСтрокой = ПредметыСтрокой
										+ ПереносСтроки
										+ "  "
										+ Строка(Предмет);
									
									ПереносСтроки = Символы.ПС;
								КонецЦикла;
								
								ВтораяЧастьТекстаОшибки = НСтр("ru = 'на файлы предметов
									|%1'");
								
								ВтораяЧастьТекстаОшибки = СтрШаблон(
									ВтораяЧастьТекстаОшибки,
									ПредметыСтрокой);
								
							КонецЕсли;
							
							ТекстОшибки = СтрШаблон(ТекстОшибки, ПерваяЧастьТекстаОшибки, ВтораяЧастьТекстаОшибки);
							Если Не ЗначениеЗаполнено(Задача) Тогда
								ТекстОшибки = ТекстОшибки + ". " + Строка(ТекЗадача);
							КонецЕсли;	
							
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
								ТекстОшибки,,
								"Исполнитель");
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
				
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;
	
	// Проверка наличия нового исполнителя среди исполнителей проектной задачи
	Если ПолучитьФункциональнуюОпцию("ВестиУчетПоПроектам") Тогда
		
		Для Каждого СтрСписок Из МассивЗадач Цикл
			
			ТекЗадача = СтрСписок.Значение;
			
			Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				ТекЗадача, "Проект");
			
			ПроектнаяЗадача = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				ТекЗадача, "ПроектнаяЗадача");
			
			Если ЗначениеЗаполнено(ПроектнаяЗадача) Тогда 
				
				Трудозатраты = Справочники.ПроектныеЗадачи.ПолучитьПлановыеТрудозатратыИсполнителяПроектнойЗадачи(
					ПроектнаяЗадача,
					Исполнитель);
				
				Если Трудозатраты = Неопределено Тогда
						
					СообщениеПользователю = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Исполнитель ""%1"" не найден среди исполнителей проектной задачи ""%2""'"),
						Строка(Исполнитель),
						Строка(ПроектнаяЗадача));
						
					Если Не ЗначениеЗаполнено(Задача) Тогда
						СообщениеПользователю = СообщениеПользователю + ". " + Строка(ТекЗадача);
					КонецЕсли;	
						
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(	
						СообщениеПользователю,
						,
						"Исполнитель",
						,
						Отказ);
				КонецЕсли;	
				
			ИначеЕсли ЗначениеЗаполнено(Проект)	Тогда 
				
				ИсполнительНайден = РаботаСПроектами.НайтиИсполнителяРольВКомандеПроекта(
						Проект,
						Исполнитель);
				
				Если Не ИсполнительНайден Тогда
							
					СообщениеПользователю = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Исполнитель ""%1"" не найден среди участников проектной команды проекта ""%2""'"),
						Строка(Исполнитель),
						Строка(Проект));
						
					Если Не ЗначениеЗаполнено(Задача) Тогда
						СообщениеПользователю = СообщениеПользователю + ". " + Строка(ТекЗадача);
					КонецЕсли;	
						
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(	
						СообщениеПользователю,
						,
						"Исполнитель",
						,
						Отказ);
				КонецЕсли;
				
			КонецЕсли;	
			
		КонецЦикла;	
			
	КонецЕсли;
	
	// Сохранение вводимых значений
	СохранениеВводимыхЗначений.ОбновитьСпискиВыбора(ЭтаФорма, ЭлементыДляСохранения(), ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИсполнительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСБизнесПроцессамиКлиент.УчастникНачалоВыбора(
		Элемент, Исполнитель, СтандартнаяОбработка, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ИсполнительОчистка(Элемент, СтандартнаяОбработка)
	
	Исполнитель = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Текст) Тогда 
		СтандартнаяОбработка = Ложь;
		ДополнениеТипа = Новый ОписаниеТипов("СправочникСсылка.ПолныеРоли");
		ДанныеВыбора = РаботаСПользователями.СформироватьДанныеВыбора(Текст, ДополнениеТипа);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИсполнительОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда 
		СтандартнаяОбработка = Ложь;
		ДополнениеТипа = Новый ОписаниеТипов("СправочникСсылка.ПолныеРоли");
		ДанныеВыбора = РаботаСПользователями.СформироватьДанныеВыбора(Текст, ДополнениеТипа);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Перенаправить(Команда)
	
	ОчиститьСообщения();
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПеренаправитьЗавершение", ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Задача) Тогда
		Если Не ОтсутствияКлиент.ПроверитьОтсутствиеПоЗадаче(ЭтаФорма, ОписаниеОповещения) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренаправитьЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(ПараметрыЗакрытия());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЭлементыДляСохранения()
	
	СохраняемыеЭлементы = Новый Структура("Исполнитель", Исполнитель);
	
	Возврат СохранениеВводимыхЗначений.СформироватьТаблицуСохраняемыхЭлементов(СохраняемыеЭлементы);
	
КонецФункции

&НаКлиенте
Функция ПараметрыЗакрытия()
	
	ПереадресацияПользователю = ТипЗнч(Исполнитель) = Тип("СправочникСсылка.Пользователи");
	
	Возврат Новый Структура("Исполнитель,РольИсполнителя,Комментарий",
		?(ПереадресацияПользователю, Исполнитель, Неопределено),
		?(ПереадресацияПользователю, Неопределено, Исполнитель),
		Комментарий);
	
	КонецФункции

&НаСервере
Процедура НастроитьЭлементыФормыДляМобильногоУстройства()
	
	ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Верх;
	Элементы.Переместить(Элементы.ИгнорироватьПредупреждения, ЭтотОбъект, Элементы.Исполнитель);
	
	Элементы.Перенаправить.Картинка = БиблиотекаКартинок.ПереместитьВправо;
	Элементы.Перенаправить.Отображение = ОтображениеКнопки.Картинка;
	
КонецПроцедуры

#КонецОбласти
